package pama1234.gdx.game.ui;

public class InfoGenerator{
  public static String[] info0001;
  public static String[] info0002;
  static {
    // genInfo_0001();
    genInfo_0002();
  }
  public static void genInfo_0001() {
    info0001=new String[] {
      "粒子不会撞墙啦！",
      "规则是很经典的贪吃蛇！",
      "将来会做成可爱的联机游戏！",
      "aparapi可能无法工作",
      "本程序需要java17运行",
      "采用并行计算！修了很久很久的算法哦",
      "经过测试，在1050Ti上可流畅运行1024*12个粒子",
      "采用异步计算（和渲染！！用户视角不易卡顿",
      "透明贴图渲染会有问题，请在阅读后关闭提示",
      "以下功能请通过测试得出用法",
      "WASD和空格和shift移动视角",
      "安卓版T打开全部设置",
      "I关闭参数信息",
      "滚轮调整视角速度",
      "右键或alt或esc更改鼠标功能",
      "RF调整位置倍数",
      "Z暂停时间，XC控制鼠标灵敏度",
      "NM调整视野范围，谨慎操作",
      "H关闭提示，改粒子数据需要改动源代码才行",
      "pama1234出品，谢谢观看",
      "————在很久之后，他终于把半自制的3D框架写好啦"
    };
  }
  public static void genInfo_0002() {
    info0002=new String[] {
      "欢迎！以下是公告",
      "请单指或双指拖拽或使用鼠标右键和滚轮调节视角位置。",
      "我准备使用libgdx和其他一些东东做一个RPG+沙盒的开源联机游戏",
      "目前依然在测试阶段，欢迎加QQ群 589219461",
      "各位可以将觉得需要实现的功能提出来，我会排序后一一实现",
      "之后一定发B站独立游戏预告（咕咕咕"
    };
  }
}