package pama1234.gdx.game.ui.generator;

public class InfoGenerator{
  public static String[] info0001=new String[] {
    "粒子不会撞墙啦！",
    "规则是很经典的贪吃蛇！",
    "将来会做成可爱的联机游戏！",
    "aparapi可能无法工作",
    "本程序需要java17运行",
    "采用并行计算！修了很久很久的算法哦",
    "经过测试，在1050Ti上可流畅运行1024*12个粒子",
    "采用异步计算（和渲染！！用户视角不易卡顿",
    "透明贴图渲染会有问题，请在阅读后关闭提示",
    "以下功能请通过测试得出用法",
    "WASD和空格和shift移动视角",
    "安卓版T打开全部设置",
    "I关闭参数信息",
    "滚轮调整视角速度",
    "右键或alt或esc更改鼠标功能",
    "RF调整位置倍数",
    "Z暂停时间，XC控制鼠标灵敏度",
    "NM调整视野范围，谨慎操作",
    "H关闭提示，改粒子数据需要改动源代码才行",
    "pama1234出品，谢谢观看",
    "————在很久之后，他终于把半自制的3D框架写好啦"
  },
    info0002=new String[] {
      "咳咳，很明显你是一个新玩家！",
      "你应该已经注意到了与应用图标（某二次元少女）和十分霸气的名字（空想世界 1）和与之十分不符的UI和画质",
      "并且心中也应该有了某种不祥的预感（比如：这不会只是又一个itch.io上一捞一大把的像素独立游戏吧）",
      "虽然但是，你的预感是十分准确的，咳咳，咳咳咳咳咳。。。。",
      "---以下是游戏说明---",
      "安卓端请单指拖拽或双指拖拽+缩放调节视角位置，电脑端使用鼠标右键和滚轮",
      "---以下是其他东东---",
      "“我准备使用libgdx和其他一些东东做一个游戏！”",
      "目前依然在原型测试阶段（而不是内测或公测或正式发布），欢迎加QQ群 589219461。",
      "各位可以将觉得需要实现的功能提出来，我会排序后一一实现。",
      "B站up主：“pama1234_2” 蓝色头像 id：646050693"
    },
    info0003=new String[] {
      "欢迎！以下是公告",
      "请单指或双指拖拽或使用鼠标右键和滚轮调节视角位置。",
      "这是一个空白的游戏框架，可以作为各位写游戏的模板。",
      "目前仍在开发阶段，欢迎加QQ群 589219461。"
    };
}