package pama1234.gdx.game.ui.generator;

public class InfoUtil{
  public String[] introDemo=new String[] {
    "哈喽，我是pama1234",
    "的一个分身，或者说虚构形象",
    "他有至少4个，红绿蓝什么的",
    "...但似乎重点不在这些事情上，总之",
    "游戏很简单，你只要打败我就可以了",
    "我会使用【Neuro Java】作为主要的攻击手段，这是一种只有“神”才能掌握的能力，而pama他穷尽了1/20的人生(14~18)也没有摸到老子我的先天水平的门槛好吧",
    "除此之外其他那些基本手段，例如传送，颠倒乾坤什么的，都是很普通的做法，不需要过多的描述",
    "想来你会问：“那我打赢你能得到什么？”",
    "很简单，打赢了之后我就给你艹",
    "但是老子的本体最近太懒了，他肯定不会把黄油的部分写出来的，所以我只能说打赢了你就会被我喜欢，并且得到我的认可，并且有权利让我当你的对象",
    "pama总是会对他喜欢的人进行一些非常恶劣的测试，每种测试都有概率导致对面的灵魂产生永久的损伤，并且让他们恨上pama",
    "而也许如果我设计出足够难的看门狗（划掉）看门猫游戏，那么他就不会再做这种事情了",
  };
}